Repository: vaimalaviya1233/running_services_monitor
Catalog: lib/l10n/app_*.arb
Languages: bn, zh

# appTitle
source: Running Services Monitor
bn: রানিং সার্ভিসেস মনিটর
zh: 运行服务监控器

# enjoyingApp
source: Enjoying the app? Consider buying me a coffee!
bn: অ্যাপটি ভালো লাগছে? আমাকে এক কাপ কফি কিনে দিতে পারেন!
zh: 喜欢这款应用吗？考虑给我买杯咖啡吧！

source: Donate
bn: দান করুন
zh: 捐赠

source: Search apps...
bn: অ্যাপ খুঁজুন...
zh: 搜索应用...

source: All
bn: সব
zh: 全部

source: User
bn: ইউজার
zh: 用户

source: System
bn: সিস্টেম
zh: 系统

source: Close Search
bn: অনুসন্ধান বন্ধ করুন
zh: 关闭搜索

source: Search
bn: অনুসন্ধান
zh: 搜索

# autoUpdate
source: Auto-Update (3s)
bn: অটো-আপডেট (৩ সেকেন্ড)
zh: 自动更新 (3秒)

source: Refresh
bn: রিফ্রেশ
zh: 刷新

source: Toggle Theme
bn: থিম পরিবর্তন করুন
zh: 切换主题

source: About
bn: সম্পর্কে
zh: 关于

source: Loading...
bn: লোড হচ্ছে...
zh: 加载中...

source: Developer
bn: ডেভেলপার
zh: 开发者

source: Email
bn: ইমেল
zh: 电子邮件

source: Source Code
bn: সোর্স কোড
zh: 源代码

source: Blogs
bn: ব্লগ
zh: 博客

# buyMeCoffee
source: Buy Me a Coffee
bn: বাই মি আ কফি
zh: 给我点杯咖啡

source: Made in Bangladesh
bn: বাংলাদেশে তৈরি
zh: 孟加拉制造

source: Running app
bn: চলমান অ্যাপ
zh: 正在运行的应用

# stopWarning
source: This app can't safely be stopped. If you stop it, you may lose some of your current work.
bn: এই অ্যাপটি নিরাপদে বন্ধ করা যাবে না। আপনি এটি বন্ধ করলে আপনার বর্তমান কাজের কিছু অংশ হারাতে পারেন।
zh: 此应用无法安全停止。如果强制停止，您可能会丢失部分当前正在运行的工作。

source: Active Services
bn: সক্রিয় সার্ভিসসমূহ
zh: 活动中的服务

source: Shizuku Required
bn: শিজুকু প্রয়োজন
zh: 需要 Shizuku

# shizukuRequiredMessage
source: This app requires Shizuku to access running services information.
bn: রানিং সার্ভিসেস তথ্য অ্যাক্সেস করতে এই অ্যাপটির শিজুকু প্রয়োজন।
zh: 此应用需要 Shizuku 权限来访问正在运行的服务信息。

source: Setup Steps:
bn: সেটআপ ধাপসমূহ:
zh: 设置步骤：

# step1
source: Install Shizuku app from Play Store or GitHub
bn: প্লে স্টোর বা গিটহাব থেকে শিজুকু অ্যাপ ইনস্টল করুন
zh: 从 Play 商店或 GitHub 安装 Shizuku 应用

# step2
source: Open Shizuku and start the service
bn: শিজুকু খুলুন এবং সার্ভিস চালু করুন
zh: 打开 Shizuku 并启动服务

# step3
source: For Android 11+: Use Wireless Debugging
bn: অ্যান্ড্রয়েড ১১+: ওয়্যারলেস ডিবাগিং ব্যবহার করুন
zh: 对于 Android 11+：使用无线调试

# step4
source: For Android 10 and below: Connect to PC via ADB
bn: অ্যান্ড্রয়েড ১০ এবং তার নিচে: এডিবি এর মাধ্যমে পিসিতে সংযুক্ত করুন
zh: 对于 Android 10 及以下：通过 ADB 连接电脑

# step5
source: Return to this app and retry
bn: এই অ্যাপে ফিরে আসুন এবং পুনরায় চেষ্টা করুন
zh: 返回此应用并重试

# quickStart
source: Quick Start (Android 11+)
bn: দ্রুত শুরু (অ্যান্ড্রয়েড ১১+)
zh: 快速启动 (Android 11+)

# quickStartSteps
source: 1. Enable Developer Options 2. Enable Wireless Debugging 3. Open Shizuku and tap "Pair" 4. Follow on-screen instructions
bn: ১. ডেভেলপার অপশন চালু করুন ২. ওয়্যারলেস ডিবাগিং চালু করুন ৩. শিজুকু খুলুন এবং "পেয়ার" এ ট্যাপ করুন ৪. স্ক্রিনে দেখানো নির্দেশাবলী অনুসরণ করুন
zh: 1. 启用开发者选项 2. 启用无线调试 3. 打开 Shizuku 并点击“配对” 4. 按照屏幕提示操作

source: Exit App
bn: অ্যাপ থেকে বের হন
zh: 退出应用

source: Retry
bn: পুনরায় চেষ্টা করুন
zh: 重试

source: Loading services...
bn: সার্ভিস লোড হচ্ছে...
zh: 加载服务中...

source: Device memory
bn: ডিভাইস মেমোরি
zh: 设备内存

source: No matching apps
bn: কোনো অ্যাপ পাওয়া যায়নি
zh: 没有匹配的应用

source: No apps found
bn: কোনো অ্যাপ পাওয়া যায়নি
zh: 未找到应用

source: of RAM
bn: র‍্যাম এর
zh: 内存

source: process and
bn: প্রসেস এবং
zh: 进程和

source: services
bn: সার্ভিস
zh: 服务

source: Apps
bn: অ্যাপস
zh: 应用

source: Free
bn: ফাঁকা
zh: 可用

source: Stop Service
bn: সার্ভিস বন্ধ করুন
zh: 停止服务

source: Stop All Services
bn: সব সার্ভিস বন্ধ করুন
zh: 停止所有服务

# stopServiceConfirm
source: Stop this service?
bn: এই সার্ভিস বন্ধ করবেন?
zh: 停止此服务？

# stopAllServicesConfirm
source: Stop all services for this app?
bn: এই অ্যাপের সব সার্ভিস বন্ধ করবেন?
zh: 停止此应用的所有服务？

# stopServiceWarning
source: This will force stop the app. You may lose unsaved data.
bn: এটি অ্যাপটি জোরপূর্বক বন্ধ করবে। আপনি সংরক্ষণ না করা ডেটা হারাতে পারেন।
zh: 这将强制停止应用。您可能会丢失未保存的数据。

source: Service stopped
bn: সার্ভিস বন্ধ হয়েছে
zh: 服务已停止

source: All services stopped
bn: সব সার্ভিস বন্ধ হয়েছে
zh: 所有服务已停止

# stopServiceError
source: Failed to stop service
bn: সার্ভিস বন্ধ করতে ব্যর্থ
zh: 停止服务失败

source: Cancel
bn: বাতিল
zh: 取消

source: Stop
bn: বন্ধ করুন
zh: 停止

source: Permission Required
bn: অনুমতি প্রয়োজন
zh: 需要权限

# permissionRequiredMessage
source: Shizuku permission is required to access running services information.
bn: রানিং সার্ভিসেস তথ্য অ্যাক্সেস করতে শিজুকু অনুমতি প্রয়োজন।
zh: 需要 Shizuku 权限才能访问正在运行的服务信息。

# permissionSteps
source: How to Grant Permission:
bn: কিভাবে অনুমতি দিবেন:
zh: 如何授予权限：

# permissionStep1
source: Open the Shizuku app
bn: শিজুকু অ্যাপ খুলুন
zh: 打开 Shizuku 应用

# permissionStep2
source: Go to 'Authorized Apps' or 'Permissions'
bn: 'অনুমোদিত অ্যাপস' বা 'অনুমতি' এ যান
zh: 前往“已授权应用”或“权限”

# permissionStep3
source: Find 'Running Services Monitor' and grant permission
bn: 'রানিং সার্ভিসেস মনিটর' খুঁজুন এবং অনুমতি দিন
zh: 找到“Running Services Monitor”并授予权限

# permissionNote
source: Make sure Shizuku service is running before granting permission.
bn: অনুমতি দেওয়ার আগে নিশ্চিত করুন যে শিজুকু সার্ভিস চলছে।
zh: 授予权限前，请确保 Shizuku 服务正在运行。

source: Open Shizuku
bn: শিজুকু খুলুন
zh: 打开 Shizuku

# systemAppWarning
source: ⚠️ WARNING: This is a SYSTEM APP. Stopping it may cause your device to malfunction or become unstable. Only proceed if you know what you're doing!
bn: ⚠️ সতর্কতা: এটি একটি সিস্টেম অ্যাপ। এটি বন্ধ করলে আপনার ডিভাইস ত্রুটিপূর্ণ বা অস্থিতিশীল হতে পারে। শুধুমাত্র তখনই এগিয়ে যান যদি আপনি জানেন আপনি কী করছেন!
zh: ⚠️ 警告：这是**系统应用**。强制停止可能会导致您的设备出现故障或不稳定。请仅在您知道自己在做什么的情况下继续！

# runningServicesTitle
source: System Running Services
bn: রানিং সার্ভিসেস
zh: 系统运行服务

# openRunningServicesTooltip
source: Open Running Services in Android Settings
bn: অ্যান্ড্রয়েড সেটিংসে রানিং সার্ভিসেস খুলুন
zh: 在安卓设置中打开运行服务

source: Error
bn: ত্রুটি
zh: 错误

# appInfoNotFound
source: App information not found
bn: অ্যাপের তথ্য পাওয়া যায়নি
zh: 未找到应用信息

# pageNotFound
source: Page not found: {location}
bn: পৃষ্ঠা পাওয়া যায়নি: {location}
zh: 未找到页面：{location}

source: Used
bn: ব্যবহৃত
zh: 已用

source: Package
bn: প্যাকেজ
zh: 包名

source: Service
bn: সার্ভিস
zh: 服务

source: Process
bn: প্রসেস
zh: 进程

source: PID
bn: পিআইডি
zh: 进程ID (PID)

source: UID
bn: ইউআইডি
zh: 用户ID (UID)

source: RAM Usage
bn: র‍্যাম ব্যবহার
zh: 内存占用

source: Intent
bn: ইনটেন্ট

source: Foreground
bn: ফোরগ্রাউন্ড
zh: 前台

source: Foreground ID
bn: ফোরগ্রাউন্ড আইডি
zh: 前台ID

source: Start Requested
bn: স্টার্ট রিকোয়েস্টেড
zh: 已请求启动

source: Created From FG
bn: ফোরগ্রাউন্ড থেকে তৈরি
zh: 从前台创建

source: Create Time
bn: তৈরির সময়
zh: 创建时间

source: Last Activity
bn: সর্বশেষ অ্যাক্টিভিটি
zh: 最后活动时间

source: Base Dir
bn: বেস ডিরেক্টরি
zh: 基础目录

source: Data Dir
bn: ডেটা ডিরেক্টরি
zh: 数据目录

source: Type
bn: ধরন
zh: 类型

source: System App
bn: সিস্টেম অ্যাপ
zh: 系统应用

source: User App
bn: ব্যবহারকারী অ্যাপ
zh: 用户应用

source: Raw Output
bn: র আউটপুট
zh: Raw 输出

source: Close
bn: বন্ধ করুন
zh: 关闭

source: Yes
bn: হ্যাঁ
zh: 是

source: No
bn: না
zh: 否

source: Connections
bn: কানেকশনসমূহ
zh: 连接

source: Flags
bn: ফ্ল্যাগস
zh: 标志

source: Visible
bn: দৃশ্যমান
zh: 可见

source: Capabilities
bn: ক্যাপাবিলিটিস
zh: 能力

source: Active
bn: সক্রিয়
zh: 活动

source: Cached
bn: ক্যাশড
zh: 缓存

source: No services found
bn: কোনো সার্ভিস পাওয়া যায়নি
zh: 未找到服务

source: RAM Calculation
bn: র‍্যাম হিসাব
zh: 内存计算

source: Total RAM
bn: মোট র‍্যাম
zh: 总内存

# ramSources
source: Sources
bn: সোর্সসমূহ
zh: 来源

# noRamDataAvailable
source: No RAM data available for this app in the system memory report.
bn: এই অ্যাপের জন্য সিস্টেম মেমোরি রিপোর্টে কোনো র‍্যাম ডেটা নেই।
zh: 在系统内存报告中，此应用没有可用的内存数据。

# ramCalculationExplanation
source: RAM is calculated from system memory info. PID = Process ID lookup, Process = Process name lookup, LRU = Recent process list.
bn: র‍্যাম সিস্টেম মেমোরি তথ্য থেকে গণনা করা হয়। PID = প্রসেস আইডি লুকআপ, Process = প্রসেস নাম লুকআপ, LRU = সাম্প্রতিক প্রসেস তালিকা।
zh: 内存数据来自系统内存信息。PID = 进程ID查找，Process = 进程名称查找，LRU = 最近进程列表。

source: Verify Command
bn: যাচাই কমান্ড
zh: 验证命令

source: Copied to clipboard
bn: ক্লিপবোর্ডে কপি হয়েছে
zh: 已复制到剪贴板

source: Copy
bn: কপি
zh: 复制

source: and
bn: এবং
zh: 和

# service_string
source: {count, plural, one {1 service} other {{count} services}}
bn: {count, plural, one {1 সার্ভিস} other {{count} সার্ভিসগুলো}}
zh: {count}个服务

# process_string
source: {count, plural, one {1 process} other {{count} processes}}
bn: {count, plural, one {1 প্রক্রিয়া} other {{count} প্রক্রিয়াগুলো}}
zh: {count}个进程

# service_process_string
source: {processCount, plural, one {1 process} other {{processCount} processes}} and {serviceCount, plural, one {1 service} other {{serviceCount} services}}
bn: {processCount, plural, one {1 প্রক্রিয়া} other {{processCount} প্রক্রিয়াগুলো}} এবং {serviceCount, plural, one {1 সার্ভিস} other {{serviceCount} সার্ভিসগুলো}}
zh: {processCount}个进程和{serviceCount}个服务

source: Info
bn: তথ্য
zh: 信息

# followSystem
source: System
bn: সিস্টেম
zh: 跟随系统

source: Contributors
bn: অবদানকারী
zh: 贡献者

# contributionsCount
source: {count} contributions
bn: {count} অবদান
zh: {count} 次贡献

source: Checking permissions...
bn: অনুমতি যাচাই করা হচ্ছে...
zh: 正在检查权限...

# shizukuNotRunning
source: Shizuku is not running. Please start Shizuku app.
bn: শিজুকু চলছে না। অনুগ্রহ করে শিজুকু অ্যাপ চালু করুন।
zh: Shizuku 未运行。请启动 Shizuku 应用。

# permissionDeniedShizuku
source: Permission denied. Please grant Shizuku permission.
bn: অনুমতি অস্বীকার করা হয়েছে। অনুগ্রহ করে শিজুকু অনুমতি দিন।
zh: 权限被拒绝。请授予 Shizuku 权限。

# failedToInitialize
source: Failed to initialize. Please grant permission.
bn: ইনিশিয়ালাইজ করতে ব্যর্থ। অনুগ্রহ করে অনুমতি দিন।
zh: 初始化失败。请授予权限。

source: Error initializing Shizuku
bn: শিজুকু ইনিশিয়ালাইজ করতে ত্রুটি
zh: 初始化 Shizuku 时出错

source: Loading apps...
bn: অ্যাপস লোড হচ্ছে...
zh: 正在加载应用...

source: Refreshed successfully
bn: সফলভাবে রিফ্রেশ হয়েছে
zh: 刷新成功

source: Error loading data
bn: ডেটা লোড করতে ত্রুটি
zh: 加载数据时出错

source: Failed to stop all services
bn: সব সার্ভিস বন্ধ করতে ব্যর্থ
zh: 停止所有服务失败

# failedToStopServiceName
source: Failed to stop service {serviceName}
bn: {serviceName} সার্ভিস বন্ধ করতে ব্যর্থ
zh: 停止服务 {serviceName} 失败

# errorPrefix
source: Error: {error}
bn: ত্রুটি: {error}
zh: 错误: {error}

source: Language
bn: ভাষা
zh: 语言

source: Open GitHub Profile
bn: গিটহাব প্রোফাইল খুলুন
zh: 打开 GitHub 个人资料

# appInfoTooltip
source: App Info
bn: অ্যাপ তথ্য
zh: 应用信息

source: OK
bn: ঠিক আছে
zh: 确定

source: Recent Calling UID
bn: সাম্প্রতিক কলিং UID
zh: 最近调用的 UID

source: App Details
bn: অ্যাপ বিস্তারিত
zh: 应用详情

# processStateTitle
source: Process State
bn: প্রসেস স্টেট
zh: 进程状态

# processStateFg
source: Foreground - App is currently in the foreground
bn: ফোরগ্রাউন্ড - অ্যাপটি বর্তমানে ফোরগ্রাউন্ডে আছে
zh: 前台 - 应用当前在前台运行

# processStateVis
source: Visible - App has a visible activity but not in foreground
bn: ভিজিবল - অ্যাপের একটি দৃশ্যমান অ্যাক্টিভিটি আছে কিন্তু ফোরগ্রাউন্ডে নয়
zh: 可见 - 应用有可见的活动但不在前台

# processStatePrev
source: Previous - Previously used foreground app
bn: পূর্ববর্তী - পূর্বে ব্যবহৃত ফোরগ্রাউন্ড অ্যাপ
zh: 上一个 - 之前使用的前台应用

# processStatePrcp
source: Perceptible - App is doing something the user is aware of
bn: পার্সেপটিবল - অ্যাপ এমন কিছু করছে যা ব্যবহারকারী জানে
zh: 可感知 - 应用正在执行用户可感知的操作

# processStateSvcb
source: Service B - App has a bound service
bn: সার্ভিস B - অ্যাপের একটি বাউন্ড সার্ভিস আছে
zh: 绑定服务 - 应用有绑定服务

# processStateHome
source: Home - Home/Launcher app
bn: হোম - হোম/লঞ্চার অ্যাপ
zh: 主页 - 主屏幕/启动器应用

# processStateHvy
source: Heavy Weight - Heavy weight app process
bn: হেভি ওয়েট - ভারী ওজনের অ্যাপ প্রসেস
zh: 重量级 - 重量级应用进程

# processStatePsvc
source: Persistent Service - App has a persistent service
bn: পার্সিস্ট্যান্ট সার্ভিস - অ্যাপের একটি স্থায়ী সার্ভিস আছে
zh: 持久服务 - 应用有持久服务

# processStatePers
source: Persistent - System persistent process
bn: পার্সিস্ট্যান্ট - সিস্টেম স্থায়ী প্রসেস
zh: 持久 - 系统持久进程

# processStateCchEmpty
source: Cached Empty - Cached process with no activities
bn: ক্যাশড এম্পটি - কোনো অ্যাক্টিভিটি ছাড়া ক্যাশড প্রসেস
zh: 空缓存 - 没有活动的缓存进程

# processStateCchAct
source: Cached Activity - Cached process with activities
bn: ক্যাশড অ্যাক্টিভিটি - অ্যাক্টিভিটি সহ ক্যাশড প্রসেস
zh: 活动缓存 - 有活动的缓存进程

# processStateCchClient
source: Cached Client - Cached process as service client
bn: ক্যাশড ক্লায়েন্ট - সার্ভিস ক্লায়েন্ট হিসেবে ক্যাশড প্রসেস
zh: 客户端缓存 - 作为服务客户端的缓存进程

# processStateCch
source: Cached - Process is cached in memory
bn: ক্যাশড - প্রসেস মেমোরিতে ক্যাশড
zh: 缓存 - 进程已缓存在内存中

# processStateBfgs
source: Bound Foreground Service - Bound to a foreground service
bn: বাউন্ড ফোরগ্রাউন্ড সার্ভিস - একটি ফোরগ্রাউন্ড সার্ভিসে বাউন্ড
zh: 绑定前台服务 - 绑定到前台服务

# processStateRcvr
source: Receiver - App is running a broadcast receiver
bn: রিসিভার - অ্যাপ একটি ব্রডকাস্ট রিসিভার চালাচ্ছে
zh: 接收器 - 应用正在运行广播接收器

# processStateTop
source: Top - App is at the top of the activity stack
bn: টপ - অ্যাপ অ্যাক্টিভিটি স্ট্যাকের শীর্ষে আছে
zh: 顶部 - 应用在活动栈顶部

# processStateBtop
source: Bound Top - Bound to a top app
bn: বাউন্ড টপ - একটি টপ অ্যাপে বাউন্ড
zh: 绑定顶部 - 绑定到顶部应用

# processStateImpf
source: Important Foreground - Important foreground process
bn: ইম্পর্ট্যান্ট ফোরগ্রাউন্ড - গুরুত্বপূর্ণ ফোরগ্রাউন্ড প্রসেস
zh: 重要前台 - 重要的前台进程

# processStateImpb
source: Important Background - Important background process
bn: ইম্পর্ট্যান্ট ব্যাকগ্রাউন্ড - গুরুত্বপূর্ণ ব্যাকগ্রাউন্ড প্রসেস
zh: 重要后台 - 重要的后台进程

# processStateUnknown
source: Process state: {state}
bn: প্রসেস স্টেট: {state}
zh: 进程状态: {state}

source: Working Mode
bn: ওয়ার্কিং মোড
zh: 工作模式

# rootMode
source: Root
bn: রুট

# shizukuMode
source: Shizuku
bn: শিজুকু

source: Select Working Mode
bn: ওয়ার্কিং মোড নির্বাচন করুন
zh: 选择工作模式

source: Available
bn: উপলব্ধ
zh: 可用

source: Not Available
bn: অনুপলব্ধ
zh: 不可用

# modeNotAvailable
source: This mode is not available
bn: এই মোড অনুপলব্ধ
zh: 此模式不可用

# noModeAvailable
source: No permission mode available
bn: কোনো পারমিশন মোড উপলব্ধ নেই
zh: 没有可用的权限模式

source: Command Logs
bn: কমান্ড লগস
zh: 命令日志

source: Command Output
bn: কমান্ড আউটপুট
zh: 命令输出

# noCommandLogs
source: No commands executed yet
bn: এখনো কোনো কমান্ড কার্যকর হয়নি
zh: 尚未执行任何命令

source: Clear Logs
bn: লগ পরিষ্কার করুন
zh: 清除日志

# clearLogsConfirm
source: Are you sure you want to clear all command logs?
bn: আপনি কি সব কমান্ড লগ পরিষ্কার করতে চান?
zh: 确定要清除所有命令日志吗？

source: Executed at
bn: কার্যকর হয়েছে
zh: 执行时间

source: Command
bn: কমান্ড
zh: 命令

source: No output
bn: কোনো আউটপুট নেই
zh: 无输出

# executeCommand
source: Execute
bn: কার্যকর করুন
zh: 执行

source: Processes
bn: প্রসেসগুলো
zh: 进程

# processesDescription
source: All running processes for this app from memory info.
bn: এই অ্যাপের জন্য মেমোরি তথ্য থেকে সব চলমান প্রসেস।
zh: 该应用从内存信息中获取的所有运行进程。

source: No processes found
bn: কোনো প্রসেস পাওয়া যায়নি
zh: 未找到进程
